<?php

// if you want to change this information careful and makesure all of informations is right !
// author : RezaFaghih
// اگر قصد تغییر در هرکدام از اطلاعات زیر را دارید مراقب باشید تمامی اطلاعات را صحیح وارد کنید

// username : نام کاربری ادمین پنل است، دقت کنید این اطلاعات را از روت تغییر دهید و نام کاربری و پسوورد مدنظر خودتان را اینجا قراردهید
// password : پسوورد ادمین پنل
//  نکته : ادمین پنل هیچ ارتباطی به پرداخت ها ندارد و تنها برای شخصی سازی پنل و لیست آخرین پرداخت ها است پس نگران نباشید حتی اگر شخصی توانست وارد ادمین پنل شود امکان برداشت وجه از حساب یا ... را ندارد و تنها میتوانید پنل را شخصی سازی کنید همچنین از طریق مقدار 
// lock 
// میتوانید پنل مدیریت را قفل کنید تا هیچکس نتواند وارد آن شود

$info = [
  'username' => 'root',
  'password' => 'root',
  'min' => 5000,
  'zarinpal' => "984b85a8-c228-11e8-af87-005056a205be",
  'lock' => false, // این مقدار دهی برای قفل کردن پنل مدیریت است و میتوانید اینگونه دسترسی پنل مدیریت را برای همه ببندید
  'ipLock' => '', // با استفاده از این مقدار میتوانید قفل آی پی تنظیم کنید تا ورود به پنل مدیریت تنها با آی پی شما امکان پذیر باشید (توجه داشته باشید در اینجا آی پی هر شخصی را وارد کنید همان شخص میتواند وارد پنل شود)
];


function getInfo($infoName){
  global $info;

  if (isset($info[$infoName])){
    return $info[$infoName];
  }
}

